# Условия (if)

## Task1: Определение нотации MAC

Существуют несколько нотаций предствления MAC адреса, например:

- IEEE EUI-48: `50-46-5D-6E-8C-20`
- IEEE EUI-48 lowercase: `50-46-5d-6e-8c-20`
- UNIX: `50:46:5d:6e:8c:20`
- cisco: `5046:5d6e:8c20`
- bare: `50465d6e8c20`

Нужно написать код, который определяет тип нотации адреса из перечисленных выше.

Входные данные: строка, содержащая MAC адрес.

- 50-46-5D-6E-8C-20
- 50-46-5d-6e-8c-20
- 50:46:5d:6e:8c:20
- 5046:5d6e:8c20
- 50465d6e8c20
- 50465d:6e8c20

Результат: напечатанный тип нотации. Если определить не удалось - напечать `нотация для 50465d:6e8c20: неизвестна` (это для последнего примера)

```python

ieee_eui_48 = 'IEEE EUI-48'
ieee_eui_48_lowercase = 'IEEE EUI-48 lowercase'
unix = 'UNIX'
cisco = 'cisco'
bare =  'bare'


s = '''

- 50-46-5D-6E-8C-20
- 50-46-5d-6e-8c-20
- 50:46:5d:6e:8c:20
- 5046:5d6e:8c20
- 50465d6e8c20
- 50465d:6e8c20

'''.strip()


for mac in s.splitlines():
    mac = mac.lstrip('-').lstrip()
    if mac.isalnum():
        print(f'нотация для {mac}: {bare}')
    elif mac.isupper():
        print(f'нотация для {mac}: {ieee_eui_48}')
    elif mac.islower() and '-' in mac:
        print(f'нотация для {mac}: {ieee_eui_48_lowercase}')
    elif len(mac.split(":")) == 3:
        print(f'нотация для {mac}: {cisco}')
    elif len(mac.split(":")) > 3:
        print(f'нотация для {mac}: {unix}')
    else:
        print(f'нотация для {mac}: неизвестна')

```

## Task2: Определение класса ip адреса

Есть переменная с ip адресом (строка), нужно опрделить класс (A/B/C/D/E) ip адреса.

```python
ip = "10.3.2.1"

if int(ip.split('.')[0]) <= 126:
    print(f'Класс ip {ip}: A')
elif 128 <= int(ip.split('.')[0]) < 192:
     print(f'Класс ip {ip}: B')
elif 192 <= int(ip.split('.')[0]) < 224:
     print(f'Класс ip {ip}: C')
elif 224 <= int(ip.split('.')[0]) < 240:
     print(f'Класс ip {ip}: D')
elif 240 <= int(ip.split('.')[0]) < 248:
     print(f'Класс ip {ip}: E')
```

## Task3: Использование dict вместо if

Есть два шаблона интерфейсов

```python
access = """
interface {if_name}
   switchport mode access
   switchport access vlan {vlan}
!
""".strip()

trunk = """
interface {if_name}
   switchport mode trunk
   switchport trunk allowed vlan {vlan}
!
""".strip()
```

Есть два словаря с параметрами интерфейсов:

```python
intf1 = {
    "if_name": "gi0/1",
    "vlan": 102,
    "mode": "access",
}

intf2 = {
    "if_name": "gi0/2",
    "vlan": 103,
    "mode": "trunk",
}
```

Нужно подставить параметры интерфейсов в соответсвующие шаблоны и получить конфигурацию обоих интерфейсов (тип интерфейса задается по ключу mode) двумя способами:

1. с использованием условий (т.е. с `if`)
2. без использования условий (без `if`)

```python
if intf1.get('mode') in access.splitlines()[1]:
    intf1_config = access.format(if_name = intf1.get("if_name"), vlan = intf1.get("vlan"))
if intf2.get('mode') in trunk.splitlines()[1]:
    intf2_config = trunk.format(if_name = intf2.get("if_name"), vlan = intf2.get("vlan"))
```
```python
intf1_config = intf1.get('mode') in access.splitlines()[1] and access.format(if_name = intf1.get("if_name"), vlan = intf1.get("vlan"))
intf2_config = intf2.get('mode') in trunk.splitlines()[1] and trunk.format(if_name = intf2.get("if_name"), vlan = intf2.get("vlan"))

```
